# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/Versioned/src/atg/remote/multisite/SiteAdminStoreResources_vi.properties#1 $$Change: 788278 $
atg_flags=[PX][i18n,l10n \u0103]

################
# Store.EStore #
################

SiteRepository.siteConfiguration.backInStockFromAddress.contextHelp=[PX][Specify the sender address for emails notifying customers a previously backordered SKU is back in stock. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.orderConfirmationFromAddress.contextHelp=[PX][Specify the sender address for emails providing order confirmation information after an order is placed. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.orderShippedFromAddress.contextHelp=[PX][Specify the sender address for emails notifying customers their orders have been shipped. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
SiteRepository.siteConfiguration.promotionEmailAddress.contextHelp=[PX][Specify the sender address for any promotions that generate customer emails. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
SiteRepository.siteConfiguration.resourceBundle.contextHelp=[PX][Specify the path to the default resource bundle containing the translatable text for the store pages. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
SiteRepository.siteConfiguration.emailAFriendEnabled.contextHelp=[PX][Specify whether the store supports the "email a friend" feature. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.defaultCountry.contextHelp=[PX][Specify the default country for the site. \u0103\u01A1\u01B0 \u0103]
SiteRepository.siteConfiguration.defaultPageSize.contextHelp=[PX][Specify the default number of products to be displayed on a subcategory or search results page. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
SiteRepository.siteConfiguration.newProductThresholdDays.contextHelp=[PX][Specify the maximum number of days since a given product's creation date for the product to be considered new. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
SiteRepository.siteConfiguration.cssFile.contextHelp=[PX][Specify the path for the base filename of the cascading stylesheets for the site. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
SiteRepository.siteConfiguration.largeSiteIcon.contextHelp=[PX][Specify the pathname of the large icon used to identify the site. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.newPasswordFromAddress.contextHelp=[PX][Specify the sender address for emails supplying new passwords to users who click the "Forgot your password" link on the Login page. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.changePasswordFromAddress.contextHelp=[PX][Specify the sender address for emails notifying customers that their passwords were updated. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.registeredUserFromAddress.contextHelp=[PX][Specify the sender address for emails notifying customers that their accounts were created. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.billableCountries.contextHelp=[PX][Specify the country codes of the countries the store can bill to. If you specify a value for this property, leave "Nonbillable country codes" empty. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
SiteRepository.siteConfiguration.nonBillableCountries.contextHelp=[PX][Specify the country codes of the countries the store cannot bill to. If you specify a value for this property, leave "Billable country codes" empty. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
SiteRepository.siteConfiguration.shippableCountries.contextHelp=[PX][Specify the country codes of the countries to which items can be shipped. If you specify a value for this property, leave "Nonshippable country codes" empty. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
SiteRepository.siteConfiguration.nonShippableCountries.contextHelp=[PX][Specify the country codes of the countries to which items cannot be shipped. If you specify a value for this property, leave "Shippable country codes" empty. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]

##############################
# Store.EStore.International #
##############################

SiteRepository.siteConfiguration.defaultLanguage.contextHelp=[PX][Specify the default language for the site. \u0103\u01A1\u01B0 \u0103]
SiteRepository.siteConfiguration.languages.contextHelp=[PX][Specify the languages supported by the site. \u0103\u01A1\u01B0 \u0103\u01A1]

