# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/Versioned/src/atg/remote/multisite/SiteAdminStoreResources_es.properties#5 $$Change: 797167 $
atg_flags=i18n,l10n

################
# Store.EStore #
################

SiteRepository.siteConfiguration.backInStockFromAddress.contextHelp=Especifique la direcci\u00F3n del remitente para los mensajes que notifican a los clientes que una unidad de almacenamiento reservada est\u00E1 de nuevo en stock.
SiteRepository.siteConfiguration.orderConfirmationFromAddress.contextHelp=Especifique la direcci\u00F3n del remitente para los mensajes que proporcionan informaci\u00F3n sobre confirmaci\u00F3n de las \u00F3rdenes una vez que \u00E9stas se han realizado.
SiteRepository.siteConfiguration.orderShippedFromAddress.contextHelp=Especifique la direcci\u00F3n del remitente para los mensajes que notifican a los clientes que sus \u00F3rdenes se han enviado.
SiteRepository.siteConfiguration.promotionEmailAddress.contextHelp=Especifique la direcci\u00F3n del remitente para las promociones que generan mensajes a los clientes.
SiteRepository.siteConfiguration.resourceBundle.contextHelp=Especifique la ruta al grupo de recursos por defecto que contiene el texto para traducir de las p\u00E1ginas de la tienda.
SiteRepository.siteConfiguration.emailAFriendEnabled.contextHelp=Especifique si la tienda admite la funci\u00F3n "enviar a un amigo".
SiteRepository.siteConfiguration.defaultCountry.contextHelp=Especifique el pa\u00EDs por defecto del sitio.
SiteRepository.siteConfiguration.defaultPageSize.contextHelp=Especifique el n\u00FAmero por defecto de productos que se mostrar\u00E1n en una subcategor\u00EDa o en una p\u00E1gina de resultados de b\u00FAsqueda.
SiteRepository.siteConfiguration.newProductThresholdDays.contextHelp=Especifique el n\u00FAmero m\u00E1ximo de d\u00EDas que un producto se considerar\u00E1 nuevo tras su fecha de creaci\u00F3n.
SiteRepository.siteConfiguration.cssFile.contextHelp=Especifique la ruta al nombre de archivo base de las hojas de estilo en cascada del sitio.
SiteRepository.siteConfiguration.largeSiteIcon.contextHelp=Especifique la ruta al icono grande utilizado para identificar el sitio.
SiteRepository.siteConfiguration.newPasswordFromAddress.contextHelp=Especifique la direcci\u00F3n del remitente para los mensajes que proporcionan nuevas contrase\u00F1as a los usuarios que hacen clic en el enlace "\u00BFHa olvidado su contrase\u00F1a?" de la p\u00E1gina de conexi\u00F3n.
SiteRepository.siteConfiguration.changePasswordFromAddress.contextHelp=Especifique la direcci\u00F3n del remitente para los mensajes que notifican a los clientes que sus contrase\u00F1as se han actualizado.
SiteRepository.siteConfiguration.registeredUserFromAddress.contextHelp=Especifique la direcci\u00F3n del remitente para los mensajes que notifican a los clientes que sus cuentas se han creado.
SiteRepository.siteConfiguration.billableCountries.contextHelp=Especifique los c\u00F3digos de los pa\u00EDses en los que la tienda puede facturar. Si especifica un valor en esta propiedad, deje "C\u00F3digos de pa\u00EDs sin facturaci\u00F3n" vac\u00EDo.
SiteRepository.siteConfiguration.nonBillableCountries.contextHelp=Especifique los c\u00F3digos de los pa\u00EDses en los que la tienda no puede facturar. Si especifica un valor en esta propiedad, deje "C\u00F3digos de pa\u00EDs con facturaci\u00F3n" vac\u00EDo.
SiteRepository.siteConfiguration.shippableCountries.contextHelp=Especifique los c\u00F3digos de los pa\u00EDses a los que se pueden enviar art\u00EDculos. Si especifica un valor en esta propiedad, deje "C\u00F3digos de pa\u00EDs sin env\u00EDo" vac\u00EDo.
SiteRepository.siteConfiguration.nonShippableCountries.contextHelp=Especifique los c\u00F3digos de los pa\u00EDses a los que no se pueden enviar art\u00EDculos. Si especifica un valor en esta propiedad, deje "C\u00F3digos de pa\u00EDs con env\u00EDo" vac\u00EDo.

##############################
# Store.EStore.International #
##############################

SiteRepository.siteConfiguration.defaultLanguage.contextHelp=Especifique el idioma por defecto del sitio.
SiteRepository.siteConfiguration.languages.contextHelp=Especifique los idiomas que se admiten en el sitio.

