# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/Versioned/src/atg/remote/multisite/SiteAdminStoreResources_de.properties#5 $$Change: 797167 $
atg_flags=i18n,l10n

################
# Store.EStore #
################

SiteRepository.siteConfiguration.backInStockFromAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr E-Mails an, mit denen Kunden dar\u00FCber informiert werden, dass eine zuvor nachbestellte SKU wieder auf Lager ist.
SiteRepository.siteConfiguration.orderConfirmationFromAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr E-Mails mit Bestellbest\u00E4tigungsinformationen nach erfolgter Bestellung an.
SiteRepository.siteConfiguration.orderShippedFromAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr E-Mails an, mit denen Kunden \u00FCber den Versand ihrer Bestellung informiert werden.
SiteRepository.siteConfiguration.promotionEmailAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr Promotions ein, die Kunden-E-Mails generieren.
SiteRepository.siteConfiguration.resourceBundle.contextHelp=Geben Sie den Pfad zum Standardressourcen-Bundle an, das den \u00FCbersetzbaren Text f\u00FCr die Shop-Seiten enth\u00E4lt.
SiteRepository.siteConfiguration.emailAFriendEnabled.contextHelp=Geben Sie an, ob der Shop die Funktion "E-Mail an einen Freund senden" unterst\u00FCtzt.
SiteRepository.siteConfiguration.defaultCountry.contextHelp=Geben Sie das Standardland f\u00FCr die Site an.
SiteRepository.siteConfiguration.defaultPageSize.contextHelp=Geben Sie die Standardanzahl an Produkten an, die auf einer Seite mit Unterkategorien oder Suchergebnissen angezeigt werden sollen.
SiteRepository.siteConfiguration.newProductThresholdDays.contextHelp=Geben Sie die maximale Anzahl an Tagen an, die ein Produkt nach dem Erstellungsdatum noch als neu gilt.
SiteRepository.siteConfiguration.cssFile.contextHelp=Geben Sie den Pfad f\u00FCr den Basisdateinamen der CSS-Dateien f\u00FCr die Site an.
SiteRepository.siteConfiguration.largeSiteIcon.contextHelp=Geben Sie den Pfadnamen des gro\u00DFen Symbols zur Identifizierung der Site an.
SiteRepository.siteConfiguration.newPasswordFromAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr E-Mails an, mit denen Benutzern, die auf der Anmeldeseite auf den Link "Kennwort vergessen" geklickt haben, neue Kennw\u00F6rter zugesendet werden.
SiteRepository.siteConfiguration.changePasswordFromAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr E-Mails an, mit denen Kunden \u00FCber die \u00C4nderung ihres Kennworts informiert werden.
SiteRepository.siteConfiguration.registeredUserFromAddress.contextHelp=Geben Sie die Absenderadresse f\u00FCr E-Mails an, mit denen Kunden \u00FCber die Erstellung ihres Accounts informiert werden.
SiteRepository.siteConfiguration.billableCountries.contextHelp=Geben Sie die L\u00E4ndercodes der L\u00E4nder an, in die Rechnungen versendet werden k\u00F6nnen. Wenn Sie einen Wert f\u00FCr diese Eigenschaft angeben, lassen Sie "Codes nicht fakturierbare L\u00E4nder" leer.
SiteRepository.siteConfiguration.nonBillableCountries.contextHelp=Geben Sie die L\u00E4ndercodes f\u00FCr die L\u00E4nder an, in die keine Rechnungen versendet werden k\u00F6nnen. Wenn Sie einen Wert f\u00FCr diese Eigenschaft angeben, lassen Sie "Codes fakturierbare L\u00E4nder" leer.
SiteRepository.siteConfiguration.shippableCountries.contextHelp=Geben Sie die L\u00E4ndercodes der L\u00E4nder an, in die Artikel versandt werden k\u00F6nnen. Wenn Sie einen Wert f\u00FCr diese Eigenschaft angeben, lassen Sie "Codes nicht f\u00FCr Versand zugelassene L\u00E4nder" leer.
SiteRepository.siteConfiguration.nonShippableCountries.contextHelp=Geben Sie die L\u00E4ndercodes der L\u00E4nder an, in die Artikel nicht versandt werden k\u00F6nnen. Wenn Sie einen Wert f\u00FCr diese Eigenschaft angeben, lassen Sie "Codes f\u00FCr Versand zugelassene L\u00E4nder" leer.

##############################
# Store.EStore.International #
##############################

SiteRepository.siteConfiguration.defaultLanguage.contextHelp=Geben Sie die Standardsprache f\u00FCr die Site an.
SiteRepository.siteConfiguration.languages.contextHelp=Geben Sie die von der Site unterst\u00FCtzten Sprachen an.

