# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/promotion/PromotionResources_es.properties#5 $$Change: 797167 $

atg_flags=i18n,l10n

##################################
# Resources to be localized

# Licensing
noLicense=No se ha podido encontrar el archivo de licencia: {0}, {1}

noCouponFound=No se ha podido encontrar ning\u00FAn cup\u00F3n para el c\u00F3digo de canje.
CouponExpired=El cup\u00F3n ya ha caducado.
noCouponUses=No quedan m\u00E1s usos para el cup\u00F3n {0}
errorClaimingCoupon=Se ha producido un error al canjear el cup\u00F3n.
couponPriorToStartDate=El cup\u00F3n no tiene validez todav\u00EDa. 
couponPromoNotAdded=No es elegible para esta promoci\u00F3n.
maxNumOfCouponsPerOrderReached=No se puede canjear el cup\u00F3n porque ya se ha alcanzado el l\u00EDmite m\u00E1ximo de cupones por orden.
noPromotionSupplied=No se ha proporcionado ninguna promoci\u00F3n, no se puede crear un cup\u00F3n
noPromotionFound=No se ha encontrado ninguna promoci\u00F3n para el ID de promoci\u00F3n.
noPromotionFoundWithId=No se ha encontrado ninguna promoci\u00F3n para el ID de promoci\u00F3n. {0}
noPromotionFoundOfType=No se ha encontrado ninguna promoci\u00F3n para el ID de promoci\u00F3n {0} de tipo {1}

promotionToolsNotFound=No se ha podido encontrar ning\u00FAn componente PromotionTools
orderManagerNotFound=No se ha podido encontrar ning\u00FAn componente OrderManager

nullParameter=El par\u00E1metro {0} es nulo

unusableParameterObject=El par\u00E1metro {0} ha devuelto un objeto que no se puede utilizar, clase = {1}
noPromotions=No existe ninguna promoci\u00F3n para el usuario

requestError=Error de solicitud

noPromotionParameter=No se ha transferido ning\u00FAn par\u00E1metro de promoci\u00F3n
promotionNotRepositoryItem=El par\u00E1metro de promoci\u00F3n no es un componente RepositoryItem

cannotGetPromotionItemDescriptor=No se puede obtener el descriptor de art\u00EDculo del par\u00E1metro de promoci\u00F3n
# Placeholders will be shipping discount, order discount or item discount.
wrongPromotionItemDescriptor=El par\u00E1metro de promoci\u00F3n no es una instancia del descriptor de art\u00EDculo: {0}, es: {1}.

usingNucleusProfile=El par\u00E1metro de perfil especificado no es un perfil, resolviendo el perfil de Nucleus

skuDoesNotExist=La unidad de almacenamiento especificada no existe

promotionRemoved=La promoci\u00F3n {0} se ha eliminado, por lo que no se puede agregar al perfil {1}.

nullProfile=No se puede proporcionar la promoci\u00F3n, porque el perfil no es v\u00E1lido.
nullPromotion=No se puede proporcionar la promoci\u00F3n, porque falta el c\u00F3digo o es incorrecto.
invalidProfile=No se puede proporcionar la promoci\u00F3n, porque el perfil no es v\u00E1lido.
invalidPromotion=No se puede proporcionar la promoci\u00F3n, porque falta el c\u00F3digo o es incorrecto.
expiredPromotion=No se puede proporcionar la promoci\u00F3n, porque \u00E9sta ha caducado.
anonymousProfile=Para utilizar esta promoci\u00F3n, debe conectarse o registrarse.
duplicatePromotion=No se puede agregar la promoci\u00F3n {0} al perfil {1}, porque \u00E9ste ya contiene dicha promoci\u00F3n
usedPromotion=Ya ha canjeado esta promoci\u00F3n.
repositoryException=No se puede proporcionar la promoci\u00F3n, debido a un error interno.
nullActivePromotion=Existe un art\u00EDculo nulo en la lista de promociones activas del perfil {0}

# User messages for promotion errors
expiredPromotionUserResource=La promoci\u00F3n ha caducado
anonymousProfileUserResource=Esta promoci\u00F3n no se puede conceder a un usuario an\u00F3nimo; con\u00E9ctese o reg\u00EDstrese
promotionRemovedUserResource=No se puede conceder esta promoci\u00F3n, puesto que ya se ha eliminado del perfil
duplicatePromotionUserResource=Su perfil ya contiene esta promoci\u00F3n
usedPromotionUserResource=No se puede conceder esta promoci\u00F3n, puesto que ya la ha utilizado

#ClosenessQualifierDroplet
invalidTypeParameter=El par\u00E1metro "type" de ClosenessQualifierDroplet debe ser "item", "order", "shipping" o "tax"

#DisqualifyRemovedItemClosenessQualifiers
nullMessageSender=La propiedad "messageSender" no puede ser nula.

#Promotion Import Export API

importExportSessionIdNotSpecified=No se ha especificado el ID de sesi\u00F3n de importaci\u00F3n/exportaci\u00F3n
duplicateImportExportSessionId=Se ha especificado un ID de sesi\u00F3n de importaci\u00F3n/exportaci\u00F3n duplicado
promotionTransactionCreationFailed=Se ha producido un error al crear la transacci\u00F3n de la promoci\u00F3n - {0}
promotionIntegratorFailed=Se ha producido un error en el integrador de la promoci\u00F3n - {0}
invalidImportExportSession=Sesi\u00F3n de importaci\u00F3n/exportaci\u00F3n no v\u00E1lida
invalidPromotionImportExportObject=Objeto de importaci\u00F3n/exportaci\u00F3n de promoci\u00F3n no v\u00E1lido
promotionTransactionSwitchFailed=Se ha producido un error al cambiar la transacci\u00F3n de la promoci\u00F3n - {0}
promotionTransactionCommitRollbackFailed=Se ha producido un error al confirmar o anular la transacci\u00F3n de la promoci\u00F3n - {0}
invalidClosenessQualifierAction=Acci\u00F3n de cualificador de proximidad no v\u00E1lida
promotionTemplateError=Error de plantilla de promoci\u00F3n - {0}
promotionTemplateErrorNoProperties=El gestor de plantillas no ha devuelto ninguna propiedad
promotionTemplateErrorTypeMismatch=El tipo del art\u00EDculo en promoci\u00F3n no coincide con el tipo del art\u00EDculo de la plantilla
invalidCouponAction=Acci\u00F3n de cup\u00F3n no v\u00E1lida
invalidClosenessQualifierImportExportObject=Objeto de importaci\u00F3n/exportaci\u00F3n de cualificador de proximidad no v\u00E1lido
closenessQualifierTemplateError=Error de plantilla de cualificador de proximidad - {0}
closenessQualifierTemplateErrorNoProperties=El gestor de plantillas no ha devuelto ninguna propiedad
invalidCouponImportExportObject=Objeto de importaci\u00F3n/exportaci\u00F3n de cup\u00F3n no v\u00E1lido
couponIdNotSpecified=No se ha especificado el ID de cup\u00F3n
couponItemNotFound=No se ha encontrado el art\u00EDculo del cup\u00F3n {0}
invalidPromotionForCoupon=Promoci\u00F3n no v\u00E1lida para el cup\u00F3n
promotionExportFailed=Se ha producido un error al exportar la promoci\u00F3n - {0}
rqlQueryNotSpecified=No se han especificado la consulta RQL
promotionCreationFailed=Se ha producido un error al crear la promoci\u00F3n - {0}
promotionIdNotSpecified=No se ha especificado el ID de promoci\u00F3n
promotionItemNotFound=No se ha encontrado el art\u00EDculo en promoci\u00F3n {0}
promotionTypeNotValid=La propiedad de tipo de promoci\u00F3n no contiene un valor v\u00E1lido
promotionRetrievalFailed=Se ha producido un error al recuperar la promoci\u00F3n - {0}
promotionPropertyMapNotSet=No se ha definido la asignaci\u00F3n de propiedades de promoci\u00F3n
promotionUpdateFailed=Se ha producido un error al actualizar la promoci\u00F3n - {0}
closenessQualifierCreationFailed=Se ha producido un error al crear el cualificador de proximidad - {0}
closenessQualifierIdNotSpecified=No se ha especificado el ID de cualificador de proximidad
closenessQualifierItemNotFound=No se ha encontrado el art\u00EDculo del cualificador de proximidad {0}
closenessQualifierRetrievalFailed=Se ha producido un error al recuperar el cualificador de proximidad - {0}
closenessQualifierPropertyMapNotSet=No se ha definido la asignaci\u00F3n de propiedades del cualificador de proximidad
closenessQualifierUpdateFailed=Se ha producido un error al actualizar el cualificador de proximidad - {0}
closenessQualifierDeletionFailed=Se ha producido un error al suprimir el cualificador de proximidad - {0}
promotionFolderPathNotSpecified=No se ha especificado la ruta de la carpeta de promociones
promotionFolderPathInvalid=La ruta de la carpeta de promociones no es v\u00E1lida = {0}
promotionFolderCreationFailed=Se ha producido un error al crear la carpeta de promociones - {0}
promotionFolderIdNotSpecified=No se ha especificado el ID de carpeta de promociones
promotionFolderRetrievalFailed=Se ha producido un error al recuperar la carpeta de promociones - {0}
noPromotionsFound=No se ha encontrado ninguna promoci\u00F3n
promotionQueryFailed=Se ha producido un error al consultar la promoci\u00F3n - {0}
promotionProcessingFailed=Se ha producido un error al procesar la promoci\u00F3n - {0}
closenessQualifierProcessingFailed=Se ha producido un error al procesar el cualificador de proximidad - {0}
noPromotionsSpecified=No se ha especificado el procesamiento de ninguna promoci\u00F3n
noClosenessQualifiersSpecified=No se ha especificado el procesamiento de ning\u00FAn cualificador de proximidad

# GWP
orderHasActivePromotions=Haga clic en Ver carro completo, para consultar los detalles.
gwpMessageSummaryGiftQualified=
gwpMessageSummaryGiftInvalidated=
gwpMessageSummaryPromotionQualified=Ha conseguido un regalo.
gwpMessageSummaryPromotionInvalidated=Debido a cambios en el carro de la compra, se ha eliminado una promoci\u00F3n de regalo aplicada anteriormente.
gwpMessageSummaryPromotionPartialFailure=Ha conseguido un regalo, pero algunos art\u00EDculos de regalo no est\u00E1n disponibles en este momento.
gwpMessageSummaryPromotionFullFailure=El regalo no est\u00E1 disponible en este momento.
