# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/UserMessages_vi.properties#1 $$Change: 788278 $
# $Revision: #1 $
atg_flags=[PX][i18n,l10n \u0103]

noItemsToAdd=[PX][Please select a quantity before clicking Add to Cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
NoParamSpecified=[PX][You must specify either an orderId or a userId as a parameter to this droplet. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
NoB2BParamSpecified=[PX][You must specify either an orderId, or a userId, or a costCenterId as a parameter to this droplet. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]


# B2CStore user error messages
errorWithBillingInfo=[PX][Your billing information did not pass validation. Please fix the problem. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
errorWithShippingInfo=[PX][Unable to validate your shipping information. Please correct the information. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
passwordsDontMatch=[PX][The passwords you entered do not match, please try again. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
passwordIsEmpty=[PX][The password is empty, please fill in a password. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
duplicateUser=[PX][A user with this email address already exists. Please choose a new email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
duplicateNickname=[PX][There is already an address with this nickname in your address book. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
emailIsEmpty=[PX][You must supply an email address to register. \u0103\u01A1\u01B0 \u0103\u01A1]
itemOutOfStock=[PX][Out of Stock! We''re sorry but {0} is not available at this time. You can either place {0} in your Wishlist for purchase later or remove {0} from your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
giftItemOutOfStock=[PX][The product named {0} is no longer available.  Please either remove the out-of-stock free gift or select another, if available. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
invalidRecipientEmailAddress=[PX][Please enter a valid recipient email address. \u0103\u01A1\u01B0 \u0103\u01A1]
invalidSenderEmailAddress=[PX][Please enter a valid sender email address. \u0103\u01A1\u01B0 \u0103]
errorCreatingShippingAddress=[PX][An error occurred creating your shipping address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]

EmailInvalid=[PX][The email address is invalid \u0103]
EmailMissing=[PX][The email address is missing \u0103]

# ShoppingCartShareableType information displayed in Site Admin
ShoppingCartShareableTypeName=[PX][Shopping Cart \u0103]
