# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/UserMessages_es.properties#5 $$Change: 797167 $
# $Revision: #5 $
atg_flags=i18n,l10n

noItemsToAdd=Antes de hacer clic en Agregar a carro, seleccione una cantidad.
NoParamSpecified=Debe especificar los valores orderId o userID como par\u00E1metros de este droplet.
NoB2BParamSpecified=Debe especificar los valores orderId, userID o costCenterId como par\u00E1metros de este droplet.


# B2CStore user error messages
errorWithBillingInfo=La informaci\u00F3n de facturaci\u00F3n no ha superado la validaci\u00F3n. Corrija el problema.
errorWithShippingInfo=No se puede validar la informaci\u00F3n de env\u00EDo. Corr\u00EDjala.
passwordsDontMatch=Las contrase\u00F1as que ha introducido no coinciden. Vuelva a intentarlo.
passwordIsEmpty=La contrase\u00F1a est\u00E1 vac\u00EDa, indique una.
duplicateUser=Ya existe un usuario con esta direcci\u00F3n de correo electr\u00F3nico. Introduzca una nueva direcci\u00F3n.
duplicateNickname=Ya existe una direcci\u00F3n con este alias en su libreta de direcciones.
emailIsEmpty=Debe proporcionar una direcci\u00F3n de correo electr\u00F3nico para registrarse.
itemOutOfStock=Fuera de stock. En estos momentos, el art\u00EDculo {0} no est\u00E1 disponible. Puede incluir el art\u00EDculo {0} en la lista de deseos para comprarlo m\u00E1s adelante o eliminar este art\u00EDculo {0} del carro.
giftItemOutOfStock=El producto con el nombre {0} ya no est\u00E1 disponible. Elimine el regalo que est\u00E1 fuera de stock o seleccione otro, si est\u00E1 disponible.
invalidRecipientEmailAddress=Introduzca una direcci\u00F3n de correo electr\u00F3nico de destinatario v\u00E1lida.
invalidSenderEmailAddress=Introduzca una direcci\u00F3n de correo electr\u00F3nico de remitente v\u00E1lida.
errorCreatingShippingAddress=Se ha producido un error al crear su direcci\u00F3n de env\u00EDo

EmailInvalid=La direcci\u00F3n de correo electr\u00F3nico no es v\u00E1lida
EmailMissing=Falta la direcci\u00F3n de correo electr\u00F3nico

# ShoppingCartShareableType information displayed in Site Admin
ShoppingCartShareableTypeName=Carro de compra
