# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/UserMessages_de.properties#5 $$Change: 797167 $
# $Revision: #5 $
atg_flags=i18n,l10n

noItemsToAdd=W\u00E4hlen Sie eine Menge aus, bevor Sie auf "In den Warenkorb" klicken.
NoParamSpecified=Sie m\u00FCssen f\u00FCr dieses Droplet entweder orderId oder userId als Parameter angeben.
NoB2BParamSpecified=Sie m\u00FCssen f\u00FCr dieses Droplet entweder orderId, userId oder costCenterId als Parameter angeben.


# B2CStore user error messages
errorWithBillingInfo=Ihre Fakturierungsinformationen haben die Validierung nicht bestanden. Beheben Sie das Problem.
errorWithShippingInfo=Die Versandinformationen konnten nicht validiert werden. Korrigieren Sie die Informationen.
passwordsDontMatch=Die eingegebenen Kennw\u00F6rter stimmen nicht \u00FCberein. Versuchen Sie es erneut.
passwordIsEmpty=Das Kennwort ist leer. Geben Sie ein Kennwort ein.
duplicateUser=Es ist bereits ein Benutzer mit dieser E-Mail-Adresse vorhanden. W\u00E4hlen Sie eine neue E-Mail-Adresse aus.
duplicateNickname=Es ist bereits eine Adresse mit diesem Kurznamen in Ihrem Adressbuch vorhanden.
emailIsEmpty=Sie m\u00FCssen eine E-Mail-Adresse zur Registrierung angeben.
itemOutOfStock=Nicht auf Lager. {0} ist derzeit leider nicht verf\u00FCgbar. Sie k\u00F6nnen {0} zum sp\u00E4teren Kauf in Ihre Wunschliste aufnehmen oder {0} aus dem Warenkorb entfernen.
giftItemOutOfStock=Das Produkt mit dem Namen {0} ist nicht mehr verf\u00FCgbar. Entfernen Sie das Gratisgeschenk, das nicht auf Lager ist, oder w\u00E4hlen Sie ein anderes aus, falls verf\u00FCgbar.
invalidRecipientEmailAddress=Geben Sie eine g\u00FCltige E-Mail-Adresse f\u00FCr den Empf\u00E4nger ein. 
invalidSenderEmailAddress=Geben Sie eine g\u00FCltige E-Mail-Adresse f\u00FCr den Absender ein.
errorCreatingShippingAddress=Beim Erstellen der Versandadresse ist ein Fehler aufgetreten.

EmailInvalid=E-Mail-Adresse ist ung\u00FCltig
EmailMissing=E-Mail-Adresse fehlt

# ShoppingCartShareableType information displayed in Site Admin
ShoppingCartShareableTypeName=Warenkorb
