# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/purchase/PurchaseProcessResources_es.properties#5 $$Change: 797167 $
atg_flags=i18n

#atg.commerce.order.purchase* resources
invalidDateFormat=Introduzca una fecha de nacimiento v\u00E1lida.
missingClaimableManager=El servicio tiene un componente ClaimableManager nulo.
missingPaymentGroupManager=El servicio tiene un componente PaymentGroupManager nulo.
missingCommerceProfileTools=El servicio tiene un componente CommerceProfileTools nulo.
missingCreditCardsPropertyName=Falta el nombre de la propiedad de tarjeta de cr\u00E9dito en el servicio.
missingRepriceChainId=No se ha reasignado el precio de la orden, puesto que no se ha especificado ning\u00FAn ID de cadena de pipeline.

missingShippingGroupManager=El servicio tiene un componente ShippingGroupManager nulo.
missingShippingAddressesPropertyName=Falta el nombre de la propiedad de direcciones de env\u00EDo en el servicio.
missingDefaultAddressPropertyName=Falta el nombre de la propiedad de direcci\u00F3n de env\u00EDo por defecto en el servicio.
missingEmailAddressPropertyName=Falta el nombre de la propiedad de la direcci\u00F3n de correo electr\u00F3nico en el servicio.

nullOrder=El servicio tiene una orden nula.
nullProfile=El servicio tiene un perfil nulo.
missingPaymentGroupInitializer=Existe un tipo de PaymentGroup {0} sin PaymentGroupInitializer registrado.
errorInitializingPaymentGroup=Error en PaymentGroupInitializer {0}.
typeNotOrder=El par\u00E1metro es un tipo no v\u00E1lido, se esperaba atg.commerce.order.Order.

missingShippingGroupInitializer=Existe un tipo de ShippingGroup {0} sin PaymentGroupInitializer registrado.
errorInitializingShippingGroup=Error en ShippingGroupInitializer {0}.
errorInitializingCommerceItemGiftShipping=Error al inicializar CommerceItemShippingInfos.

# Miscellaneous form handler errors
missingTransactionManager=Se necesita un componente TransactionManager.
missingExpiredSessionProfile=Debe especificar un perfil de usuario para que checkFormRedirect maneje las sesiones caducadas.
missingLocalLockManager=Si useLocksAroundTransactions es verdadero, debe especificar un valor de localLockManager.
missingTransactionLockFactory=No se puede obtener un bloqueo de transacci\u00F3n, ya que TransactionLockFactory no est\u00E1 correctamente configurado
missingUseLocksProfile=Si useLocksAroundTransactions es verdadero, debe especificar un perfil de usuario.
missingProfileDefaultBillingAddress=El perfil tiene una direcci\u00F3n de facturaci\u00F3n por defecto nula.
missingProfileDefaultCreditCard=El perfil tiene una tarjeta de cr\u00E9dito por defecto nula.
missingProfileDefaultShippingAddress=El perfil tiene una direcci\u00F3n de env\u00EDo por defecto nula.
missingPaymentGroupMap=Se necesita paymentGroupMapContainer.
missingProfileRepository=Se necesita profileRepository.

#PurchaseProcessHelper
errorAddingToOrder=Se ha producido un error desconocido al agregar un art\u00EDculo a la orden con ID [{0}].
errorRemovingItemFromOrder=Se ha producido un error desconocido al eliminar un art\u00EDculo de la orden con ID [{0}].
errorCreatingOrder=Se ha producido un error desconocido al crear una orden.
errorAddingShippingGroup=Se ha producido un error desconocido al agregar una direcci\u00F3n de env\u00EDo a la orden con ID [{0}].
errorSettingOrderAmount=Se ha producido un error desconocido al definir el grupo de pago con ID [{0}] en la orden con ID [{1}].
errorAddingCreditCard=Se ha producido un error desconocido al agregar una tarjeta de cr\u00E9dito a la orden con ID [{0}].
errorRemovingItemFromShippingGroup=Se ha producido un error desconocido al eliminar la cantidad {0} del art\u00EDculo comercial [{1}] del grupo de env\u00EDo [{2}] de la orden con ID [{3}].
errorMovingItemBetweenShippingGroups=Se ha producido un error desconocido al mover la cantidad {0} del art\u00EDculo comercial [{1}] del grupo de env\u00EDo [{2}] al grupo de env\u00EDo [{3}] de la orden con ID [{4}].
errorFetchingProfile=Se ha producido un error desconocido al obtener el perfil con ID [{0}].
invalidProfileId=Se ha producido un error debido a un intento de utilizar un ID de perfil no v\u00E1lido [{0}].

# B2CStore user error messages
errorWithBillingInfo=La informaci\u00F3n de facturaci\u00F3n no ha superado la validaci\u00F3n. Corrija el problema.
errorWithShippingInfo=No se puede validar la informaci\u00F3n de env\u00EDo. Corr\u00EDjala.
errorModifyingOrder=Se ha producido un error al actualizar las cantidades de la orden.
duplicateUser=Ya existe un usuario con esta direcci\u00F3n de correo electr\u00F3nico. Introduzca una nueva direcci\u00F3n.
duplicateNickname=Ya existe una direcci\u00F3n con este alias en su libreta de direcciones.
duplicateCCNickname=Ya existe una tarjeta de cr\u00E9dito con este alias en su cuenta.
nickNameWrongLength=El alias debe tener entre 1 y 42 caracteres. Introduzca otro.
missingRequiredCCNumber=Debe proporcionar un n\u00FAmero de tarjeta de cr\u00E9dito.
onlineCreditInsufficient=El cr\u00E9dito en l\u00EDnea que ha seleccionado no cubre el costo de la orden. Introduzca una tarjeta de cr\u00E9dito.
storeCreditPaymentGroupError=Se ha producido un error al crear el grupo de pago de cr\u00E9dito en l\u00EDnea.
errorAddingGiftMessage=Se ha producido un error al agregar la dedicatoria.
noCreditCardSelected=Seleccione una tarjeta de cr\u00E9dito.

#B2CStore error messages for StoreShippingProcessHelper
errorCreatingShippingGroupForDefaultAddress=Se ha producido una excepci\u00F3n al crear el grupo de env\u00EDo con la direcci\u00F3n por defecto: 
errorChangingSecondaryAddressName=No se puede cambiar el nombre de la direcci\u00F3n secundaria: 
errorCopingAddress=No se puede copiar la direcci\u00F3n: 
errorRemovingProfileRepositoryAddress=No se puede eliminar la direcci\u00F3n del repositorio de perfiles: 
