# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/purchase/PurchaseProcessResources_de.properties#5 $$Change: 797167 $
atg_flags=i18n

#atg.commerce.order.purchase* resources
invalidDateFormat=Geben Sie ein g\u00FCltiges Geburtsdatum ein.
missingClaimableManager=F\u00FCr den Service wurde ClaimableManager nicht angegeben.
missingPaymentGroupManager=F\u00FCr den Service wurde PaymentGroupManager nicht angegeben.
missingCommerceProfileTools=F\u00FCr den Service wurde CommerceProfileTools nicht angegeben.
missingCreditCardsPropertyName=F\u00FCr den Service wurde kein Eigenschaftsname f\u00FCr Kreditkarten angegeben.
missingRepriceChainId=F\u00FCr die Bestellung wurde kein neuer Preis festgesetzt, da keine Pipeline-Ketten-ID angegeben wurde.

missingShippingGroupManager=F\u00FCr den Service wurde ShippingGroupManager nicht angegeben.
missingShippingAddressesPropertyName=F\u00FCr den Service wurde kein Eigenschaftsname f\u00FCr die Versandadressen angegeben.
missingDefaultAddressPropertyName=F\u00FCr den Service wurde kein Eigenschaftsname f\u00FCr die Standardversandadresse angegeben.
missingEmailAddressPropertyName=F\u00FCr den Service wurde kein Eigenschaftsname f\u00FCr die E-Mail-Adresse angegeben.

nullOrder=F\u00FCr den Service wurde keine Bestellung angegeben.
nullProfile=F\u00FCr den Service wurde kein Profil angegeben.
missingPaymentGroupInitializer=PaymentGroup-Typ {0} ohne registrierten PaymentGroupInitializer.
errorInitializingPaymentGroup=Fehler in PaymentGroupInitializer {0}.
typeNotOrder=Der Parameter hat einen ung\u00FCltigen Typ, erwartet wurde atg.commerce.order.Order.

missingShippingGroupInitializer=ShippingGroup-Typ {0} ohne registrierten ShippingGroupInitializer.
errorInitializingShippingGroup=Fehler in ShippingGroupInitializer {0}.
errorInitializingCommerceItemGiftShipping=Fehler beim Initialisieren von CommerceItemShippingInfos.

# Miscellaneous form handler errors
missingTransactionManager=TransactionManager ist erforderlich.
missingExpiredSessionProfile=Sie m\u00FCssen ein Benutzerprofil f\u00FCr checkFormRedirect zur Behandlung von abgelaufenen Sessions angeben.
missingLocalLockManager=Sie m\u00FCssen localLockManager angeben, wenn useLocksAroundTransactions wahr ist.
missingTransactionLockFactory=Transaktionssperre kann nicht angewendet werden, da TransactionLockFactory falsch konfiguriert ist
missingUseLocksProfile=Sie m\u00FCssen ein Benutzerprofil angeben, wenn useLocksAroundTransactions wahr ist.
missingProfileDefaultBillingAddress=F\u00FCr das Profil wurde keine Standardrechnungsadresse angegeben.
missingProfileDefaultCreditCard=F\u00FCr das Profil wurde keine Standardkreditkarte angegeben.
missingProfileDefaultShippingAddress=F\u00FCr das Profil wurde keine Standardversandadresse angegeben.
missingPaymentGroupMap=paymentGroupMapContainer ist erforderlich.
missingProfileRepository=profileRepository ist erforderlich.

#PurchaseProcessHelper
errorAddingToOrder=Beim Hinzuf\u00FCgen eines Artikels zur Bestellung mit der ID [{0}] ist ein unbekannter Fehler aufgetreten.
errorRemovingItemFromOrder=Beim Entfernen eines Artikels aus der Bestellung mit der ID [{0}] ist ein unbekannter Fehler aufgetreten.
errorCreatingOrder=Beim Erstellen einer Bestellung ist ein unbekannter Fehler aufgetreten.
errorAddingShippingGroup=Beim Hinzuf\u00FCgen einer Versandadresse zur Bestellung mit der ID [{0}] ist ein unbekannter Fehler aufgetreten.
errorSettingOrderAmount=Beim Definieren der Zahlungsgruppe mit der ID [{0}] f\u00FCr die Bestellung mit der ID [{1}] ist ein unbekannter Fehler aufgetreten.
errorAddingCreditCard=Beim Hinzuf\u00FCgen einer Kreditkarte zur Bestellung mit der ID [{0}] ist ein unbekannter Fehler aufgetreten.
errorRemovingItemFromShippingGroup=Beim Entfernen der Menge {0} f\u00FCr Commerce-Artikel [{1}] aus der Versandgruppe [{2}] der Bestellung mit der ID [{3}] ist ein unbekannter Fehler aufgetreten.
errorMovingItemBetweenShippingGroups=Beim Verschieben der Menge {0} f\u00FCr Commerce-Artikel {1}] aus der Versandgruppe [{2}] in die Versandgruppe [{3}] der Bestellung mit der ID [{4}] ist ein unbekannter Fehler aufgetreten.
errorFetchingProfile=Beim Abrufen des Profils mit der ID [{0}] ist ein unbekannter Fehler aufgetreten.
invalidProfileId=Ein Fehler ist aufgetreten, da versucht wurde, eine ung\u00FCltige Profil-ID [{0}] zu verwenden. 

# B2CStore user error messages
errorWithBillingInfo=Ihre Fakturierungsinformationen haben die Validierung nicht bestanden. Beheben Sie das Problem.
errorWithShippingInfo=Die Versandinformationen konnten nicht validiert werden. Korrigieren Sie die Informationen.
errorModifyingOrder=Beim Aktualisieren der Mengen f\u00FCr Ihre Bestellung ist ein Fehler aufgetreten.
duplicateUser=Es ist bereits ein Benutzer mit dieser E-Mail-Adresse vorhanden. W\u00E4hlen Sie eine neue E-Mail-Adresse aus.
duplicateNickname=Es ist bereits eine Adresse mit diesem Kurznamen in Ihrem Adressbuch vorhanden.
duplicateCCNickname=Es ist bereits eine Kreditkarte mit diesem Kurznamen in Ihrem Account vorhanden.
nickNameWrongLength=Der Kurzname muss zwischen 1 und 42 Zeichen lang sein. Geben Sie einen neuen Kurznamen ein.
missingRequiredCCNumber=Sie m\u00FCssen eine Kreditkartennummer angeben.
onlineCreditInsufficient=Der ausgew\u00E4hlte Online-Kredit deckt die Bestellkosten nicht ab. Geben Sie eine Kreditkarte an.
storeCreditPaymentGroupError=Beim Erstellen der Onlinekreditzahlungsgruppe ist ein Fehler aufgetreten.
errorAddingGiftMessage=Beim Hinzuf\u00FCgen der Geschenknachricht ist ein Fehler aufgetreten.
noCreditCardSelected=W\u00E4hlen Sie eine Kreditkarte aus.

#B2CStore error messages for StoreShippingProcessHelper
errorCreatingShippingGroupForDefaultAddress=Beim Erstellen der Versandgruppe aus der Standardadresse ist eine Ausnahme aufgetreten:
errorChangingSecondaryAddressName=Name der sekund\u00E4ren Adresse kann nicht ge\u00E4ndert werden:
errorCopingAddress=Adresse kann nicht kopiert werden:
errorRemovingProfileRepositoryAddress=Adresse des Profil-Repositorys kann nicht entfernt werden: 
