# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/purchase/UserMessages_vi.properties#1 $$Change: 788278 $
# $Revision: #1 $
atg_flags=[PX][i18n,l10n \u0103]

##PurchaseProcessFormHandler
ConcurrentUpdateAttempt=[PX][Saving order {0} failed because doing so would result in data being overwritten. Order data for your browser window was out of date. Please re-submit your changes for them to take effect. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]

##StoreCreditInitializer
storeCreditName=[PX][{0,number,currency} Store Credit \u0103\u01A1]

##SaveOrderFormHandler
duplicateOrderDescription=[PX][The description you entered already exists in your saved orders. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]

##CancelOrderFormHandler
invalidOrderIdParameter=[PX][There was an error cancelling the order. \u0103\u01A1\u01B0 \u0103]
errorLoadingOrder=[PX][There was an error cancelling the order. \u0103\u01A1\u01B0 \u0103]
errorSendingMessage=[PX][There was an error cancelling the order. \u0103\u01A1\u01B0 \u0103]
errorCancellingOrder=[PX][There was an error cancelling the order. \u0103\u01A1\u01B0 \u0103]
cancelOrderNotCurrent=[PX][The order was not cancelled because it was not your current order. Order data for your browser window was out of date. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
userInfoNotAvailable=[PX][The order was not cancelled because we couldn't retrieve your user data. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
userNoPermissionToCancel=[PX][The order was not cancelled because it was not your order.  \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]


##CommitOrderFormHandler
errorCommittingOrder=[PX][There was an error committing the order. \u0103\u01A1\u01B0 \u0103]
orderEmpty=[PX][The order was not submitted for processing because it is empty. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
commitOrderNotCurrent=[PX][The order was not submitted for processing because it was not your current order. Order data for your browser window was out of date. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]

##ExpressCheckoutFormHandler
errorMovingToConfirmation=[PX][There was an error while moving to the order confirmation screen. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorUpdatingOrder=[PX][There was an error while attempting to update the order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
errorCopyingAddress=[PX][There was an error attempting to copy the address information. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
errorRepricingOrder=[PX][There was an error while attempting to reprice the order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
orderAlreadySubmitted=[PX][The order has already been submitted for processing. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]

#PaymentGroupFormHandler
noDefaultPaymentGroup=[PX][You did not specify a default payment method. \u0103\u01A1\u01B0 \u0103\u01A1]
invalidPaymentSplitNumber=[PX][Invalid amount to move entered. \u0103\u01A1]

#ShippingGroupFormHandler
invalidShippingSplitNumber=[PX][Invalid quantity to move entered. \u0103\u01A1]
noDefaultShippingGroup=[PX][You did not specify a default shipping method. \u0103\u01A1\u01B0 \u0103\u01A1]
errorUpdateShippingGroup=[PX][Error for updating ShippingGroup. \u0103\u01A1]
noShippingAddressSelected=[PX][You should specify a shipping address before proceeding. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]

##CartModifierFormHandler
invalidQuantity=[PX][The quantity entered is invalid. \u0103\u01A1]
errorMovingToPurchaseInfo=[PX][There was an error moving to the purchase info page. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorRemovingItemFromOrder=[PX][There was an error removing an item from the order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
unsupportedRelationship=[PX][The Relationship of type {0} is not supported. \u0103\u01A1\u01B0 \u0103\u01A1]
noItemsToAdd=[PX][Please select a quantity before clicking Add to Cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
quantityLessThanZero=[PX][Quantity is less than 0. \u0103]
quantityLessThanOrEqualToZero=[PX][Quantity is less than or equal to 0. \u0103\u01A1\u01B0]
quantityLessThanMin=[PX][Quantity is less than the minimum permitted value of {0}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
quantityMoreThanMax=[PX][Quantity is more than the maximum permitted value of {0}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
itemQuantityLessThanMin=[PX][{0} quantity is less than the minimum permitted value of {1}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
itemQuantityMoreThanMax=[PX][{0} quantity is more than the maximum permitted value of {1}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
noOrderToModify=[PX][There is no order to modify (order=null). \u0103\u01A1\u01B0 \u0103]
errorAddingToOrder=[PX][There was an error while attempting to add the item to the order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
ambiguousInputForAdd=[PX][There was conflicting input for adding items to the order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]

##PaymentAddressFormHandler
missingPaymentGroup=[PX][There is no PaymentGroup to modify. \u0103\u01A1\u01B0]
missingPaymentGroupKey=[PX][There is no PaymentGroup to modify. \u0103\u01A1\u01B0]
missingAddressId=[PX][There is no address to use. \u0103]
missingAddress=[PX][There is no address to use. \u0103]

##ShippingGroupInitializer
defaultHardgoodShippingGroupName=[PX][My Default Shipping Group \u0103]

#StoreCommitOrderHandler
confirmEmailAddressAlreadyExists=[PX][A user already exists with the email address you've selected. Please try again. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
invalidConfirmEmailAddress=[PX][Email address to receive an order confirmation email is not in proper format \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
invalidCreditCardVerificationNumber=[PX][Please enter a valid credit card verification number. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
invalidShippingMethod=[PX][You did not specify a valid shipping method. \u0103\u01A1\u01B0 \u0103\u01A1]

stateIsIncorrect=[PX][Please enter an appropriate state for {0}. \u0103\u01A1\u01B0 \u0103]


# B2CStore user error messages
errorWithBillingInfo=[PX][Your billing information did not pass validation. Please fix the problem. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
errorWithShippingInfo=[PX][Unable to validate your shipping information. Please correct the information. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
duplicateUser=[PX][A user with this email address already exists. Please choose a new email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
duplicateNickname=[PX][There is already an address with this nickname in your address book. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
emailIsEmpty=[PX][You must supply an email address to register. \u0103\u01A1\u01B0 \u0103\u01A1]
errorUpdateOrder=[PX][There was an error updating the item quantities on your order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
# {0} is the shipping method: ground, air, etc. {1} is the state/county/region the item is being shipped to.
invalidStateForMethod=[PX][Due to shipping limitations we are unable to provide {0} shipping service to {1}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
pricingError=[PX][We're sorry, there was an error pricing the order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
pricingErrorInvalidAddress=[PX][The address you have entered does not pass validation, please modify your address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
missingRequiredAddressProperty=[PX][The {0} property is required for your address. \u0103\u01A1\u01B0 \u0103\u01A1]
errorCopyingAddressToShippingGroup=[PX][We're sorry, there was an error copying that address from your address book. Please choose another one. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
additionalInfoRequired=[PX][We're sorry, but additional information is required. Once you've entered the missing information, click Continue. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
giftMessageTooLong=[PX][We're sorry, but the gift message you entered exceeds the maximum length. Please revise your message. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
noGiftMessage=[PX][We're sorry, but you must fill in the gift message field. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
errorAddingGiftMessage=[PX][There was an error adding your gift message. \u0103\u01A1\u01B0 \u0103\u01A1]
# {0} is replaced with the string containing the place/street name
invalidStreetAddress=[PX][Due to shipping limitations, we are not able to ship to street addresses containing {0}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
# {0} is replaced with the string containing the place/city name
invalidCityAddress=[PX][Due to shipping limitations, we are not able to ship to addresses with a city containing {0}. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorAddingToGiftlist=[PX][There was a problem adding the selected product to the giftlist. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorNoItemsSelected=[PX][No items have been selected. Please select an item by setting the quantity. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
invalidRecipientEmailAddress=[PX][Please enter a valid recipient email address.  \u0103\u01A1\u01B0 \u0103\u01A1]
invalidSenderEmailAddress=[PX][Please enter a valid sender email address.  \u0103\u01A1\u01B0 \u0103]
invalidItems=[PX][You cannot checkout with items in your cart that are not in the current catalog.  Please delete those items or add them to your Wishlist. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
# {0} is replace by the name of the product and {1} is replaced by the name of the country
restrictedShipping=[PX][{0} can not be shipped to {1}. \u0103\u01A1]
multipleCouponsPerOrder=[PX][There is a claimed coupon for order already. Please remove this coupon before adding a new one. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
couponNotClaimable=[PX][We're sorry, this coupon cannot be applied at this time. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
emptyCouponCode=[PX][Coupon code cannot be empty. \u0103]
invalidCouponCode=[PX][We're sorry, but this coupon code is not acceptable. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]

# add to cart error messages
addToCart_selectColorSize=[PX][Please select a color and size before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
addToCart_selectColor=[PX][Please select a color before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
addToCart_selectSize=[PX][Please select a size before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
addToCart_selectWoodFinish=[PX][Please select a finish. \u0103]
addToCart_selectSku=[PX][Please select a SKU before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]

#Add to Gift\Wish List error messages
noColorSizeSelectedWishlist=[PX][Please select a color and size before adding to your Wish List. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
noColorSizeSelectedGiftlist=[PX][Please select a color and size before adding to your Gift List. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
noFinishSelectedWishlist=[PX][Please select a finish before adding to your Wish List. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
noFinishSelectedGiftlist=[PX][Please select a finish before adding to your Gift List. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]

# StoreGiftWithPurchaseFormHandler
errorGiftOutOfStock=[PX][This product is no longer available. \u0103\u01A1\u01B0]
errorSelectedSkuIsInvalid=[PX][This product is no longer available.  \u0103\u01A1\u01B0 ]

# JS version of validation messages
errorGiftProductSkuNotSelected=[PX][Please select a free gift. \u0103]
errorGiftColorNotSelected=[PX][Please select a color before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
errorGiftSizeNotSelected=[PX][Please select a size before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
errorGiftWoodFinishNotSelected=[PX][Please select a wood finish before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
errorGiftSkuNotSelected=[PX][Please select a color and size before adding to your cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
errorGiftProductNotSelected=[PX][Please select a free gift before adding to cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]

# Non-JS version of validation message, used 
# in case SKU ID or Product ID or both are not defined 
errorGiftNotSelected=[PX][Click a Select button to specify the type of gift you want to receive, then use the corresponding menu to select a specific gift, before clicking Add to Cart. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
