# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/purchase/UserMessages_de.properties#5 $$Change: 797167 $
# $Revision: #5 $
atg_flags=i18n,l10n

##PurchaseProcessFormHandler
ConcurrentUpdateAttempt=Die Bestellung {0} konnte nicht gespeichert werden, da eine Speicherung zum \u00DCberschreiben von Daten f\u00FChren w\u00FCrde. Bestelldaten f\u00FCr Ihr Browser-Fenster waren nicht mehr aktuell. Senden Sie die \u00C4nderungen erneut, damit sie wirksam werden.

##StoreCreditInitializer
storeCreditName={0,number,currency} Gutschrift

##SaveOrderFormHandler
duplicateOrderDescription=Die eingegebene Beschreibung ist in Ihren gespeicherten Bestellungen bereits vorhanden.

##CancelOrderFormHandler
invalidOrderIdParameter=Beim Stornieren der Bestellung ist ein Fehler aufgetreten.
errorLoadingOrder=Beim Stornieren der Bestellung ist ein Fehler aufgetreten.
errorSendingMessage=Beim Stornieren der Bestellung ist ein Fehler aufgetreten.
errorCancellingOrder=Beim Stornieren der Bestellung ist ein Fehler aufgetreten.
cancelOrderNotCurrent=Die Bestellung wurde nicht storniert, da sie nicht Ihre aktuelle Bestellung war. Bestelldaten f\u00FCr Ihr Browser-Fenster waren nicht aktuell.
userInfoNotAvailable=Die Bestellung wurde nicht storniert, da Ihre Benutzerdaten nicht abgerufen werden konnten.
userNoPermissionToCancel=Die Bestellung wurde nicht storniert, da es nicht Ihre Bestellung war.


##CommitOrderFormHandler
errorCommittingOrder=Beim Festschreiben der Bestellung ist ein Fehler aufgetreten.
orderEmpty=Die Bestellung wurde nicht zur Verarbeitung weitergeleitet, da sie leer ist.
commitOrderNotCurrent=Die Bestellung wurde nicht zur Verarbeitung weitergeleitet, da es nicht Ihre aktuelle Bestellung war. Bestelldaten f\u00FCr Ihr Browser-Fenster waren nicht aktuell.

##ExpressCheckoutFormHandler
errorMovingToConfirmation=Beim Weiterleiten auf die Seite f\u00FCr die Bestellbest\u00E4tigung ist ein Fehler aufgetreten
errorUpdatingOrder=Beim Versuch, die Bestellung zu aktualisieren, ist ein Fehler aufgetreten.
errorCopyingAddress=Beim Versuch, die Adressinformationen zu kopieren, ist ein Fehler aufgetreten.
errorRepricingOrder=Beim Versuch, einen neuen Preis f\u00FCr die Bestellung festzusetzen, ist ein Fehler aufgetreten.
orderAlreadySubmitted=Die Bestellung wurde bereits zur Verarbeitung weitergeleitet.

#PaymentGroupFormHandler
noDefaultPaymentGroup=Sie haben keine Standardzahlungsart angegeben.
invalidPaymentSplitNumber=Ung\u00FCltiger Betrag zum Verschieben eingegeben.

#ShippingGroupFormHandler
invalidShippingSplitNumber=Ung\u00FCltige Menge zum Verschieben eingegeben.
noDefaultShippingGroup=Sie haben keine Standardversandart angegeben.
errorUpdateShippingGroup=Fehler beim Aktualisieren von ShippingGroup.
noShippingAddressSelected=Sie m\u00FCssen eine Versandadresse angeben, bevor Sie fortfahren.

##CartModifierFormHandler
invalidQuantity=Die eingegebene Menge ist ung\u00FCltig.
errorMovingToPurchaseInfo=Beim Weiterleiten auf die Seite f\u00FCr Bestellinformationen ist ein Fehler aufgetreten.
errorRemovingItemFromOrder=Beim Entfernen eines Artikels aus der Bestellung ist ein Fehler aufgetreten.
unsupportedRelationship=Die Beziehung vom Typ {0} wird nicht unterst\u00FCtzt.
noItemsToAdd=W\u00E4hlen Sie eine Menge aus, bevor Sie auf "In den Warenkorb" klicken.
quantityLessThanZero=Menge ist kleiner 0.
quantityLessThanOrEqualToZero=Menge ist kleiner oder gleich 0.
quantityLessThanMin=Menge ist kleiner als der zul\u00E4ssige Mindestwert von {0}.
quantityMoreThanMax=Menge ist gr\u00F6\u00DFer als der zul\u00E4ssige H\u00F6chstwert von {0}.
itemQuantityLessThanMin=Menge {0} ist kleiner als der zul\u00E4ssige Mindestwert von {1}.
itemQuantityMoreThanMax=Menge {0} ist gr\u00F6\u00DFer als der zul\u00E4ssige H\u00F6chstwert von {1}.
noOrderToModify=Es ist keine zu \u00E4ndernde Bestellung vorhanden (Bestellung=null).
errorAddingToOrder=Beim Versuch, den Artikel zur Bestellung hinzuzuf\u00FCgen, ist ein Fehler aufgetreten.
ambiguousInputForAdd=Eingabekonflikt beim Hinzuf\u00FCgen von Artikeln zur Bestellung.

##PaymentAddressFormHandler
missingPaymentGroup=Keine zu \u00E4ndernde PaymentGroup vorhanden.
missingPaymentGroupKey=Keine zu \u00E4ndernde PaymentGroup vorhanden.
missingAddressId=Keine zu verwendende Adresse vorhanden.
missingAddress=Keine zu verwendende Adresse vorhanden.

##ShippingGroupInitializer
defaultHardgoodShippingGroupName=Meine Standardversandgruppe

#StoreCommitOrderHandler
confirmEmailAddressAlreadyExists=Es ist bereits ein Benutzer mit der von Ihnen ausgew\u00E4hlten E-Mail-Adresse vorhanden. Versuchen Sie es erneut.
invalidConfirmEmailAddress=E-Mail-Adresse f\u00FCr den Empfang einer Bestellbest\u00E4tigung hat nicht das richtige Format
invalidCreditCardVerificationNumber=Geben Sie eine g\u00FCltige Pr\u00FCfnummer f\u00FCr die Kreditkarte ein.
invalidShippingMethod=Sie haben keine g\u00FCltige Versandart angegeben.

stateIsIncorrect=Geben Sie das entsprechende Bundesland f\u00FCr {0} ein.


# B2CStore user error messages
errorWithBillingInfo=Ihre Fakturierungsinformationen haben die Validierung nicht bestanden. Beheben Sie das Problem.
errorWithShippingInfo=Die Versandinformationen konnten nicht validiert werden. Korrigieren Sie die Informationen.
duplicateUser=Es ist bereits ein Benutzer mit dieser E-Mail-Adresse vorhanden. W\u00E4hlen Sie eine neue E-Mail-Adresse aus.
duplicateNickname=Es ist bereits eine Adresse mit diesem Kurznamen in Ihrem Adressbuch vorhanden.
emailIsEmpty=Sie m\u00FCssen eine E-Mail-Adresse zur Registrierung angeben.
errorUpdateOrder=Beim Aktualisieren der Artikelmengen in Ihrer Bestellung ist ein Fehler aufgetreten.
# {0} is the shipping method: ground, air, etc. {1} is the state/county/region the item is being shipped to.
invalidStateForMethod=Aufgrund von Versandbeschr\u00E4nkungen kann Versandservice {0} nach {1} nicht bereitgestellt werden.
pricingError=Bei der Preisfindung f\u00FCr die Bestellung ist leider ein Fehler aufgetreten.
pricingErrorInvalidAddress=Die eingegebene Adresse kann nicht validiert werden. \u00C4ndern Sie die Adresse.
missingRequiredAddressProperty=Die Eigenschaft {0} ist f\u00FCr Ihre Adresse erforderlich.
errorCopyingAddressToShippingGroup=Beim Kopieren dieser Adresse aus Ihrem Adressbuch ist leider ein Fehler aufgetreten. W\u00E4hlen Sie eine andere Adresse aus.
additionalInfoRequired=Es sind zus\u00E4tzliche Informationen erforderlich. Wenn Sie die fehlenden Informationen eingegeben haben, klicken Sie auf "Fortfahren".
giftMessageTooLong=Die eingegebene Geschenknachricht \u00FCberschreitet leider die maximal zul\u00E4ssige L\u00E4nge. \u00C4ndern Sie Ihre Nachricht.
noGiftMessage=Sie m\u00FCssen eine Angabe im Feld f\u00FCr die Geschenknachricht machen.
errorAddingGiftMessage=Beim Hinzuf\u00FCgen der Geschenknachricht ist ein Fehler aufgetreten.
# {0} is replaced with the string containing the place/street name
invalidStreetAddress=Aufgrund von Versandbeschr\u00E4nkungen ist ein Versand an Adressen mit {0} nicht m\u00F6glich.
# {0} is replaced with the string containing the place/city name
invalidCityAddress=Aufgrund von Versandbeschr\u00E4nkungen ist ein Versand an einen Ort mit {0} nicht m\u00F6glich.
errorAddingToGiftlist=Beim Hinzuf\u00FCgen des ausgew\u00E4hlten Produkts zur Geschenkliste ist ein Fehler aufgetreten.
errorNoItemsSelected=Es wurden keine Artikel ausgew\u00E4hlt. W\u00E4hlen Sie einen Artikel durch Angabe der entsprechenden Menge aus.
invalidRecipientEmailAddress=Geben Sie eine g\u00FCltige E-Mail-Adresse f\u00FCr den Empf\u00E4nger ein. 
invalidSenderEmailAddress=Geben Sie eine g\u00FCltige E-Mail-Adresse f\u00FCr den Absender ein. 
invalidItems=Checkout nicht m\u00F6glich, da der Warenkorb Artikel enth\u00E4lt, die nicht im aktuellen Katalog aufgef\u00FChrt sind. L\u00F6schen Sie diese Artikel, oder f\u00FCgen Sie sie zu Ihrer Wunschliste hinzu.
# {0} is replace by the name of the product and {1} is replaced by the name of the country
restrictedShipping={0} kann nicht versandt werden nach {1}.
multipleCouponsPerOrder=F\u00FCr die Bestellung wurde bereits ein Coupon angefordert. Entfernen Sie diesen Coupon, bevor Sie einen neuen hinzuf\u00FCgen.
couponNotClaimable=Dieser Coupon kann im Moment leider nicht angewendet werden.
emptyCouponCode=Couponcode darf nicht leer sein.
invalidCouponCode=Dieser Couponcode ist leider ung\u00FCltig.

# add to cart error messages
addToCart_selectColorSize=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Farbe und eine Gr\u00F6\u00DFe aus.
addToCart_selectColor=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Farbe aus.
addToCart_selectSize=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Gr\u00F6\u00DFe aus.
addToCart_selectWoodFinish=W\u00E4hlen Sie eine Oberfl\u00E4che aus.
addToCart_selectSku=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine SKU aus.

#Add to Gift\Wish List error messages
noColorSizeSelectedWishlist=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zur Wunschliste eine Farbe und eine Gr\u00F6\u00DFe aus.
noColorSizeSelectedGiftlist=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zur Geschenkeliste eine Farbe und eine Gr\u00F6\u00DFe aus.
noFinishSelectedWishlist=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zur Wunschliste eine Oberfl\u00E4che aus.
noFinishSelectedGiftlist=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zur Geschenkeliste eine Oberfl\u00E4che aus.

# StoreGiftWithPurchaseFormHandler
errorGiftOutOfStock=Dieses Produkt ist nicht mehr verf\u00FCgbar.
errorSelectedSkuIsInvalid=Dieses Produkt ist nicht mehr verf\u00FCgbar.

# JS version of validation messages
errorGiftProductSkuNotSelected=W\u00E4hlen Sie ein kostenloses Geschenk aus.
errorGiftColorNotSelected=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Farbe aus.
errorGiftSizeNotSelected=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Gr\u00F6\u00DFe aus.
errorGiftWoodFinishNotSelected=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Holzoberfl\u00E4che aus.
errorGiftSkuNotSelected=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb eine Farbe und eine Gr\u00F6\u00DFe aus.
errorGiftProductNotSelected=W\u00E4hlen Sie vor dem Hinzuf\u00FCgen zum Warenkorb ein kostenloses Geschenk aus.

# Non-JS version of validation message, used 
# in case SKU ID or Product ID or both are not defined 
errorGiftNotSelected=Geben Sie die gew\u00FCnschte Art von Geschenk an. Klicken Sie hierzu auf die entsprechende Schaltfl\u00E4che "Ausw\u00E4hlen". W\u00E4hlen Sie dann im entsprechenden Men\u00FC ein bestimmtes Geschenk aus, und klicken Sie anschlie\u00DFend auf "In den Warenkorb".
