# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/order/purchase/UserMessages_es.properties#5 $$Change: 797167 $
# $Revision: #5 $
atg_flags=i18n,l10n

##PurchaseProcessFormHandler
ConcurrentUpdateAttempt=Se ha producido un error al guardar la orden {0}, ya que hacerlo provocar\u00EDa que se sobrescribiesen datos. Los datos de orden de la ventana del explorador estaban obsoletos. Vuelva a enviar los cambios para que entren en vigor.

##StoreCreditInitializer
storeCreditName=Vale de {0,number,currency}

##SaveOrderFormHandler
duplicateOrderDescription=La descripci\u00F3n que ha introducido ya existe en las \u00F3rdenes guardadas.

##CancelOrderFormHandler
invalidOrderIdParameter=Se ha producido un error al cancelar la orden.
errorLoadingOrder=Se ha producido un error al cancelar la orden.
errorSendingMessage=Se ha producido un error al cancelar la orden.
errorCancellingOrder=Se ha producido un error al cancelar la orden.
cancelOrderNotCurrent=La orden no se ha cancelado porque no era la orden actual. Los datos de orden de la ventana del explorador estaban obsoletos.
userInfoNotAvailable=La orden no se ha cancelado porque no se han podido recuperar los datos de usuario.
userNoPermissionToCancel=La orden no se ha cancelado porque no era una orden propia.


##CommitOrderFormHandler
errorCommittingOrder=Se ha producido un error al confirmar la orden.
orderEmpty=La orden no se ha enviado a procesamiento porque est\u00E1 vac\u00EDa.
commitOrderNotCurrent=La orden no se ha enviado a procesamiento porque no era la orden actual. Los datos de orden de la ventana del explorador estaban obsoletos.

##ExpressCheckoutFormHandler
errorMovingToConfirmation=Se ha producido un error al pasar a la pantalla de confirmaci\u00F3n de la orden.
errorUpdatingOrder=Se ha producido un error al intentar actualizar la orden.
errorCopyingAddress=Se ha producido un error al intentar copiar la informaci\u00F3n de direcci\u00F3n.
errorRepricingOrder=Se ha producido un error al intentar reasignar el precio de la orden.
orderAlreadySubmitted=La orden ya se ha enviado a procesamiento.

#PaymentGroupFormHandler
noDefaultPaymentGroup=No ha especificado un m\u00E9todo de pago por defecto.
invalidPaymentSplitNumber=El importe para mover introducido no es v\u00E1lido. 

#ShippingGroupFormHandler
invalidShippingSplitNumber=La cantidad para mover introducida no es v\u00E1lida. 
noDefaultShippingGroup=No ha especificado un m\u00E9todo de env\u00EDo por defecto.
errorUpdateShippingGroup=Error al actualizar ShippingGroup.
noShippingAddressSelected=Antes de continuar, debe especificar una direcci\u00F3n de env\u00EDo.

##CartModifierFormHandler
invalidQuantity=La cantidad introducida no es v\u00E1lida.
errorMovingToPurchaseInfo=Se ha producido un error al pasar a la p\u00E1gina de informaci\u00F3n de compra.
errorRemovingItemFromOrder=Se ha producido un error al eliminar un art\u00EDculo de la orden.
unsupportedRelationship=No se admite la relaci\u00F3n de tipo {0}.
noItemsToAdd=Antes de hacer clic en Agregar a carro, seleccione una cantidad.
quantityLessThanZero=La cantidad es menor que 0.
quantityLessThanOrEqualToZero=La cantidad es menor o igual que 0.
quantityLessThanMin=La cantidad es menor que el valor m\u00EDnimo permitido de {0}.
quantityMoreThanMax=La cantidad es mayor que el valor m\u00E1ximo permitido de {0}.
itemQuantityLessThanMin=La cantidad {0} es menor que el valor m\u00EDnimo permitido de {1}.
itemQuantityMoreThanMax=La cantidad {0} es mayor que el valor m\u00E1ximo permitido de {1}.
noOrderToModify=No hay ninguna orden que modificar (orden = nula).
errorAddingToOrder=Se ha producido un error al intentar agregar el art\u00EDculo a la orden.
ambiguousInputForAdd=Se ha producido un conflicto de entrada al agregar art\u00EDculos a la orden.

##PaymentAddressFormHandler
missingPaymentGroup=No hay ning\u00FAn componente PaymentGroup para modificar.
missingPaymentGroupKey=No hay ning\u00FAn componente PaymentGroup para modificar.
missingAddressId=No existe ninguna direcci\u00F3n para utilizar.
missingAddress=No existe ninguna direcci\u00F3n para utilizar.

##ShippingGroupInitializer
defaultHardgoodShippingGroupName=Mi grupo de env\u00EDo por defecto

#StoreCommitOrderHandler
confirmEmailAddressAlreadyExists=Ya existe un usuario con la direcci\u00F3n de correo electr\u00F3nico que ha seleccionado. Int\u00E9ntelo de nuevo.
invalidConfirmEmailAddress=La direcci\u00F3n de recepci\u00F3n del correo electr\u00F3nico de confirmaci\u00F3n de orden no tiene el formato adecuado.
invalidCreditCardVerificationNumber=Introduzca un n\u00FAmero de verificaci\u00F3n de tarjeta de cr\u00E9dito v\u00E1lido.
invalidShippingMethod=No ha especificado un m\u00E9todo de env\u00EDo v\u00E1lido.

stateIsIncorrect=Introduzca un estado adecuado para {0}.


# B2CStore user error messages
errorWithBillingInfo=La informaci\u00F3n de facturaci\u00F3n no ha superado la validaci\u00F3n. Corrija el problema.
errorWithShippingInfo=No se puede validar la informaci\u00F3n de env\u00EDo. Corr\u00EDjala.
duplicateUser=Ya existe un usuario con esta direcci\u00F3n de correo electr\u00F3nico. Introduzca una nueva direcci\u00F3n.
duplicateNickname=Ya existe una direcci\u00F3n con este alias en su libreta de direcciones.
emailIsEmpty=Debe proporcionar una direcci\u00F3n de correo electr\u00F3nico para registrarse.
errorUpdateOrder=Se ha producido un error al actualizar las cantidades de art\u00EDculos de la orden.
# {0} is the shipping method: ground, air, etc. {1} is the state/county/region the item is being shipped to.
invalidStateForMethod=Debido a las limitaciones de env\u00EDo, no podemos proporcionar el servicio de env\u00EDo {0} a {1}.
pricingError=Se ha producido un error al calcular el precio de la orden.
pricingErrorInvalidAddress=La direcci\u00F3n que ha introducido no supera la validaci\u00F3n. Modif\u00EDquela.
missingRequiredAddressProperty=La propiedad {0} es necesaria para la direcci\u00F3n.
errorCopyingAddressToShippingGroup=Se ha producido un error al copiar esta direcci\u00F3n de su libreta de direcciones. Seleccione otra.
additionalInfoRequired=Falta informaci\u00F3n necesaria; despu\u00E9s de introducirla, haga clic en Continuar.
giftMessageTooLong=La dedicatoria que ha introducido supera la longitud m\u00E1xima. Corr\u00EDjala.
noGiftMessage=Debe rellenar el campo de dedicatoria.
errorAddingGiftMessage=Se ha producido un error al agregar la dedicatoria.
# {0} is replaced with the string containing the place/street name
invalidStreetAddress=Debido a las limitaciones de env\u00EDo, no podemos realizar env\u00EDos a direcciones que contengan {0}.
# {0} is replaced with the string containing the place/city name
invalidCityAddress=Debido a las limitaciones de env\u00EDo, no podemos realizar env\u00EDos a direcciones con una ciudad que contenga {0}.
errorAddingToGiftlist=Se ha producido un problema al agregar el producto seleccionado a la lista de regalos.
errorNoItemsSelected=No se ha seleccionado ning\u00FAn art\u00EDculo. Para seleccionar un art\u00EDculo, defina la cantidad.
invalidRecipientEmailAddress=Introduzca una direcci\u00F3n de correo electr\u00F3nico de destinatario v\u00E1lida.
invalidSenderEmailAddress=Introduzca una direcci\u00F3n de correo electr\u00F3nico de remitente v\u00E1lida.
invalidItems=No puede pagar con art\u00EDculos en el carro que no est\u00E9n incluidos en el cat\u00E1logo. Supr\u00EDmalos o agr\u00E9guelos a su lista de deseos.
# {0} is replace by the name of the product and {1} is replaced by the name of the country
restrictedShipping={0} no se puede enviar a {1}.
multipleCouponsPerOrder=Ya se ha canjeado un cup\u00F3n en la orden. Elim\u00EDnelo antes de agregar otro.
couponNotClaimable=Este cup\u00F3n no se puede aplicar en este momento.
emptyCouponCode=El c\u00F3digo de cup\u00F3n no puede estar vac\u00EDo.
invalidCouponCode=Este c\u00F3digo de cup\u00F3n no se puede aceptar.

# add to cart error messages
addToCart_selectColorSize=Antes de agregar el art\u00EDculo al carro, seleccione un color y una talla.
addToCart_selectColor=Antes de agregar el art\u00EDculo al carro, seleccione un color.
addToCart_selectSize=Antes de agregar el art\u00EDculo al carro, seleccione una talla.
addToCart_selectWoodFinish=Seleccione un acabado.
addToCart_selectSku=Antes de agregar el art\u00EDculo al carro, seleccione una unidad de almacenamiento.

#Add to Gift\Wish List error messages
noColorSizeSelectedWishlist=Antes de agregar el art\u00EDculo a la lista de deseos, seleccione un color y una talla.
noColorSizeSelectedGiftlist=Antes de agregar el art\u00EDculo a la lista de regalos, seleccione un color y una talla.
noFinishSelectedWishlist=Antes de agregar el art\u00EDculo a la lista de deseos, seleccione un acabado.
noFinishSelectedGiftlist=Antes de agregar el art\u00EDculo a la lista de regalos, seleccione un acabado.

# StoreGiftWithPurchaseFormHandler
errorGiftOutOfStock=Este producto ya no est\u00E1 disponible.
errorSelectedSkuIsInvalid=Este producto ya no est\u00E1 disponible.

# JS version of validation messages
errorGiftProductSkuNotSelected=Seleccione un regalo.
errorGiftColorNotSelected=Antes de agregar el art\u00EDculo al carro, seleccione un color.
errorGiftSizeNotSelected=Antes de agregar el art\u00EDculo al carro, seleccione una talla.
errorGiftWoodFinishNotSelected=Antes de agregar el art\u00EDculo al carro, seleccione un acabado en madera.
errorGiftSkuNotSelected=Antes de agregar el art\u00EDculo al carro, seleccione un color y una talla.
errorGiftProductNotSelected=Antes de agregar el art\u00EDculo al carro, seleccione un regalo.

# Non-JS version of validation message, used 
# in case SKU ID or Product ID or both are not defined 
errorGiftNotSelected=Antes de hacer clic en Agregar al carro, haga clic en un bot\u00F3n Seleccionar para especificar el tipo de regalo que desea recibir y, a continuaci\u00F3n, utilice el men\u00FA correspondiente para seleccionar el regalo concreto.
