# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/DCS-CSR/src/atg/commerce/order/purchase/PurchaseProcessResources_vi.properties#1 $$Change: 788278 $
atg_flags=[PX][i18n \u0103]

#atg.commerce.order.purchase* resources

# B2CStore user error messages
errorWithBillingInfo=[PX][Your billing information did not pass validation. Please fix the problem. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
errorWithShippingInfo=[PX][Unable to validate your shipping information. Please correct the information. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorModifyingOrder=[PX][An error occurred when updating the quantities for your order. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
passwordsDontMatch=[PX][The passwords you entered do not match, please try again. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
passwordIsEmpty=[PX][The password is empty, please fill in a password. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
passwordWrongLength=[PX][Your password must be between 5-10 characters. Please choose a new password. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
duplicateUser=[PX][A user with this email address already exists. Please choose a new email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
emailIsEmpty=[PX][You must supply an email address to register. \u0103\u01A1\u01B0 \u0103\u01A1]
duplicateNickname=[PX][There is already an address with this nickname in your address book. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
duplicateCCNickname=[PX][There is already a credit card with this nickname in your account. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
nickNameWrongLength=[PX][Your Nick Name must be between 1 - 42 characters. Please enter a new Nick Name. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
missingRequiredCCNumber=[PX][You must supply a credit card number. \u0103\u01A1\u01B0 ]
onlineCreditInsufficient=[PX][The online credit you have selected does not cover the order cost. Please enter a credit card. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
errorAddingGiftMessage=[PX][There was an error adding your gift message. \u0103\u01A1\u01B0 \u0103\u01A1]
userAlreadyExists=[PX][A user already exists with the email address you've selected. Please try again.  \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
noCreditCardSelected=[PX][Please select a credit card. \u0103]

#BillingInfoFormHandler
gcNoAmountRemaining=[PX][Gift certificate {0} has no amount remaining \u0103\u01A1\u01B0 \u0103\u01A1]
gcNotFound=[PX][Gift certificate {0} was not found \u0103\u01A1\u01B0]
