# @version $Id: //hosting-blueprint/B2CBlueprint/version/10.2/EStore/src/atg/commerce/profile/UserMessages_vi.properties#1 $$Change: 788278 $
atg_flags=[PX][i18n,l10n \u0103]

# commerce profile error messages
errorCreatingCostCenter=[PX][There was a problem creating the cost center. \u0103\u01A1\u01B0 \u0103\u01A1]
noCostCenterToRemove=[PX][The cost center does not exist \u0103\u01A1]
noCreditCard=[PX][The credit card with nickname {0} could not be found. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
defaultBillingAddress=[PX][My Billing Address \u0103]
defaultShippingAddress=[PX][My Shipping Address \u0103]

#atg.commerce.util.AddressValidatorImpl user message. This messages could come from Profile FormHandlers or
#atg.commerce.order.purchase FormHandlers. specifically from CreateHardgoodShippingGroupFormHandler, UpdateHardgoodShippingGroupFormHandler
Address1Missing=[PX][The address1 is missing in the address \u0103\u01A1\u01B0 ]
CityMissing=[PX][The city is missing in the address \u0103\u01A1\u01B0]
CountyMissing=[PX][The county is missing in the address \u0103\u01A1\u01B0]
CountryMissing=[PX][The country is missing in the address \u0103\u01A1\u01B0 ]
EmailInvalid=[PX][The email address is invalid in the address \u0103\u01A1\u01B0 \u0103]
EmailMissing=[PX][The email address is missing in the address \u0103\u01A1\u01B0 \u0103]
FaxNumberInvalid=[PX][The fax number is invalid in the address \u0103\u01A1\u01B0 \u0103]
FaxNumberMissing=[PX][The fax number is missing in the address \u0103\u01A1\u01B0 \u0103]
FirstNameMissing=[PX][The first name is missing in the address \u0103\u01A1\u01B0 \u0103]
LastNameMissing=[PX][The last name is missing in the address \u0103\u01A1\u01B0 ]
PhoneNumberInvalid=[PX][The phone number is invalid in the address \u0103\u01A1\u01B0 \u0103]
PhoneNumberMissing=[PX][The phone number is missing in the address \u0103\u01A1\u01B0 \u0103]
PostalCodeMissing=[PX][The postal code is missing in the address \u0103\u01A1\u01B0 \u0103]
StateMissing=[PX][The state is missing in the address \u0103\u01A1\u01B0]

# Profile Form Exceptions
errorCreatingAddress=[PX][An error occurred while trying to create the secondary address {0} \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorUpdatingAddress=[PX][An error occurred while trying to update the secondary address {0} \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorDeletingAddress=[PX][An error occurred while trying to delete the secondary address \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
errorDuplicateNickname=[PX][The nickname entered ({0}) is already used by another address \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
errorModifyingNickname=[PX][An error occurred while trying to change the nickname for this shipping address \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
missingCreditCardProperty=[PX][The {0} is a required field for a credit card entry \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorCreatingCreditCard=[PX][An error occurred while trying to create a new credit card entry \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorDuplicateCCNickname=[PX][The nickname {0} is already used by another credit card \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]
errorInvalidCreditCard=[PX][The credit card entered is not valid: {0} \u0103\u01A1\u01B0 \u0103]
userAlreadyExists=[PX][A user already exists with the login {0} \u0103\u01A1\u01B0 \u0103]
errorCreatingEmailRecipient=[PX][There was a problem registering your email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]
errorRemovingEmailRecipient=[PX][There was a problem in un-registering your email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1]
errorUpdatingEmailRecipient=[PX][There was a problem in updating your registered email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
invalidPasswordLength=[PX][Password must be 5-10 characters. \u0103\u01A1]
invalidPassword=[PX][The supplied password is invalid \u0103\u01A1]
invalidLoginAlreadyLoggedIn=[PX][You are already logged in, {0}. \u0103\u01A1]
errorUpdatingSecurityStatus=[PX][Unable to update the security status. \u0103\u01A1\u01B0 ]
stateRequired=[PX][Please select state for the {0} address. \u0103\u01A1\u01B0 \u0103]
stateIsIncorrect=[PX][Please enter an appropriate state for {0} country. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 ]

errorDeletingGiftAddress=[PX][Cannot delete address {0}. It is already used by gift list {1}  \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
errorDeletingShippingAddress=[PX][Cannot delete address {0}. It has been chosen as Shipping Address.  \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103]

# EmailCampaignFormHandler exceptions
invalidEmailAddress=[PX][Please enter a valid email address. \u0103\u01A1\u01B0]
invalidDateFormat=[PX][Please enter a valid Date of Birth. \u0103\u01A1\u01B0]

# Address properties as text
nickname=[PX][Address nickname \u0103]
firstName=[PX][First name \u0103]
lastName=[PX][Last name \u0103]
address1=[PX][Street address \u0103]
city=[PX][City \u0103]
state=[PX][State \u0103]
postalCode=[PX][Postal Code \u0103]
country=[PX][Country \u0103]
phoneNumber=[PX][Phone Number \u0103]

# CreditCard properties as text
creditCardNumber=[PX][Credit card number \u0103]
creditCardType=[PX][Credit card type \u0103]
expirationMonth=[PX][Expiration month \u0103]
expirationYear=[PX][Expiration year \u0103]

missingEmail=[PX][An email address is required. Please enter an email address. \u0103\u01A1\u01B0 \u0103\u01A1\u01B0 \u0103\u01A1\u01B0]
